[
    {
        "name": "Embedded Firmware/Software Engineer",
        "priority": 0,
        "description": "WAVE is seeking a Software Engineer to help design, develop, and validate the advanced charging control algorithms in a real-time embedded environment.",
        "responsibilities": "<ul> <li> Requirements gathering and verification for software </li> <li> Unitary testing and software integration </li> <li> Design, implement and validate C based algorithms for different software platforms on Freescale Kinetis and DSC micro-controller family </li> <li> Create specification, design, and validation documents </li> <li> Help oversee software quality management, including software change management, requirement traceability and non-regressive test strategies </li> </ul>",
        "qualifications": "<p><strong>Skills</strong></p> <ul> <li> BS-EE, Computer Science, or similar academic background, or comparable professional experience </li> <li> Experience in embedded development </li> <li> Familiar with software development process using agile methods </li> <li> C language programming and familiarization of assembly code </li> <li> Experience in a software version control system (GIT, SVN, CVS) </li> <li> Experience with DSRC communication systems based on 802.11p </li> <li> Experience in unitary and software integration testing using GoogleTest Framework. </li> <li> Excellent communication, interpersonal, and technical skills, along with the ability to function successfully in a small, focused team environment </li> </ul> <p><strong>Highly Desired Skills</strong></p> <ul> <li> Ability to providing vehicle integration support to customers and OEM partners </li> <li> Experience with networking embedded systems </li> <li> Experience with controller design for power electronics </li> <li> Knowledge of Controller Area Networks (CAN) for embedded systems </li> <li> Knowledge in CAN diagnostic protocol for automotive applications </li> <li> Automotive-related engineering </li> </ul>"
    },
    {
        "name": "Power Electronics Engineer",
        "priority": 0,
        "description": "WAVE is seeking a talented, versatile, and self-motivated electrical engineer with experience in power electronics, especially with electric vehicle applications. Candidates should have the ability to function in a fast-paced startup company environment where adaptability and flexibility are critical to company success. Responsibilities will include the ability to design, develop, and build power systems in the 5-200kW range.",
        "responsibilities": "<ul> <li> Designing, specifying and validating high power electrical systems with focus on manufacturability and reliability. </li> <li> Translating customer requirements into detailed hardware requirements. </li> <li> Testing, troubleshooting, and debugging to resolve critical integration issues. </li> <li> Managing quality, reliability and failure reporting to ensure continuous improvement and to prevent recurrence of failures. </li> <li> Providing vehicle integration support to customers and OEM partners. </li> <li> Support project schedule and on time delivery metrics by monitoring project progress, coordinating activities, and resolving problems. </li> <li> Innovate new solutions to WAVE products to increase reliability and to reduce lead time and cost. </li> </ul>",
        "qualifications": "<ul> <li> 10 to 15 years of electrical engineering experience with a Bachelor’s degree in Electrical Engineering (Master’s degree preferred). </li> <li> In-depth practical knowledge and experience with power electronics within power converters. </li> <li> Minimum 5 years of experience designing and validating high-power power conversion systems. </li> <li> Familiarity with simulation tools such as Dynamic system simulators (MATLAB), Circuit simulation (SPICE), Power electronic device modeling (Saber), and Electro-thermal modeling of power devices. </li> <li> Familiarity with NEC, IEC, UL, and CSA regulatory standards. </li> <li> Demonstrated ability to meet goals and objectives. </li> <li> Effective communication and presentation skills. </li> <li> Commitment to schedule and milestones with a \"get it done\" attitude. </li> <li> Commitment to quality and change management systems. </li> <li> Some travel is required. </li> <li> Experience in automotive, industrial vehicles, and electric vehicles is a plus </li> <li> 10+ years of experience with product development </li> </ul>"
    }
]
