[
    {
        "name": "Transit Operations Associate",
        "description": "WAVE is seeking a talented, versatile, and self-motivated electrical engineer with experience in power electronics, especially with electric vehicle applications. Candidates should have the ability to function in a fast-paced startup company environment where adaptability and flexibility are critical to company success. Responsibilities will include the ability to design, develop, and build power systems in the 5-200kW range.",
        "responsibilities": "<ul> <li> Designing, specifying and validating high power electrical systems with focus on manufacturability and reliability. </li> <li> Translating customer requirements into detailed hardware requirements. </li> <li> Testing, troubleshooting, and debugging to resolve critical integration issues. </li> <li> Managing quality, reliability and failure reporting to ensure continuous improvement and to prevent recurrence of failures. </li> <li> Providing vehicle integration support to customers and OEM partners. </li> <li> Support project schedule and on time delivery metrics by monitoring project progress, coordinating activities, and resolving problems. </li> <li> Innovate new solutions to WAVE products to increase reliability and to reduce lead time and cost. </li> </ul>",
        "qualifications": "<ul> <li> 10 to 15 years of electrical engineering experience with a Bachelor’s degree in Electrical Engineering (Master’s degree preferred). </li> <li> In-depth practical knowledge and experience with power electronics within power converters. </li> <li> Minimum 5 years of experience designing and validating high-power power conversion systems. </li> <li> Familiarity with simulation tools such as Dynamic system simulators (MATLAB), Circuit simulation (SPICE), Power electronic device modeling (Saber), and Electro-thermal modeling of power devices. </li> <li> Familiarity with NEC, IEC, UL, and CSA regulatory standards. </li> <li> Demonstrated ability to meet goals and objectives. </li> <li> Effective communication and presentation skills. </li> <li> Commitment to schedule and milestones with a \"get it done\" attitude. </li> <li> Commitment to quality and change management systems. </li> <li> Some travel is required. </li> <li> Experience in automotive, industrial vehicles, and electric vehicles is a plus </li> <li> 10+ years of experience with product development </li> </ul>"
    },
    {
        "name": "Power Electronics Engineer",
        "description": "WAVE is seeking a talented, versatile, and self-motivated technician with experience in electronics and vehicle electrical systems, with a preference for electric vehicle experience. Candidates should have the ability to function in a fast-paced startup company environment where adaptability and flexibility are critical to company success. Responsibilities will include the operation of the WAVE system during pilot operations, operations data collection, management, analysis, conversion and distribution of resulting information. Ability to trouble-shoot and maintain WAVE system equipment in various sites across the country.",
        "responsibilities": "<ul> <li> Operating WAVE system during pilot operations. </li> <li> Testing, troubleshooting and debugging to resolve operating issues. </li> <li> Perform upgrades, maintenance and repairs at WAVE customer locations. </li> <li> Provide vehicle integration support to customers and OEM partners. </li> </ul>",
        "qualifications": "<ul> <li> Associates degree in electronic technology. </li> <li> 3 years in-field experience with repair and maintenance of high power electronic components or systems. </li> <li> Excellent written and verbal communication skills. </li> <li> Commitment to schedule and milestones with a \"get it done\" attitude. </li> <li> Commitment to engineering quality through version control and full system testing. </li> <li> Some travel is required. </li> <li> 3– 5 years of experience. </li> <li> Experience in automotive, industrial vehicles, and electric vehicles is a plus. </li> </ul>"
    }
]